In [4]:
import pandas as pd
import numpy as np
tma = pd.read_csv('TMA.csv')
tma = list(tma['TMA Acct#'])
diag = pd.read_csv("Diagnosis_till_2018.csv")
diag.Description = diag.Description.str.lower()
diag.head(2)
def num(df):
    if 'Acct_No' in df.columns:
        name = 'Acct_No'
    else:
        name = 'TMA_Acct'
    print(len(df))
    print(len(df[name].unique()))
def show(df, n):
    if 'Acct_No' in df.columns:
        name = 'Acct_No'
    else:
        name = 'TMA_Acct'
    return df[df[name] == n]
num(diag)

348790
9829

In [5]:
new_lab = pd.read_csv("df_labdata.csv")
new_lab.rename(columns={"test_result": "result", "test_unit": 'Units'}, inplace = 'True')
new_lab['date'] = pd.to_datetime(new_lab.date)
old_lab = pd.read_csv('TMA_lab.csv')
old_lab['Lab_Date'] = pd.to_datetime(old_lab.Lab_Date)
old_lab.rename(columns={"Lab_Date": "date", "Results": "result", "Code": "test_name"}, inplace = 'True')

### Diabe

In [14]:
early_diabe = pd.read_csv('early_diabe.csv')
early_diabe = early_diabe[['TMA_Acct', 'Early_Diabete']]
num(early_diabe)

2233
2233

In [6]:
d1 = diag[diag.Code.str.match('^250')]
d2 = diag[diag.Code.str.match('^E08')]
d3 = diag[diag.Code.str.match('^E09')]
d4 = diag[diag.Code.str.match('^E10')]
d5 = diag[diag.Code.str.match('^E11')]
d6 = diag[diag.Code.str.match('^E13')]
diabe = pd.concat([d1, d2, d3, d4, d5, d6], axis = 0)
num(diabe)
diabe.head(2)

11670
2233

,Unnamed: 0,Acct_No,Date,Code,Description,Unnamed: 4
33206,33206,16,2001-02-21,250.4,diabetes with renal manifestations,NaN
33214,33214,16,2000-12-26,250.4,diabetes with renal manifestations,NaN

In [12]:
early_diabe = diabe.groupby('Acct_No').agg({'Date': [np.min]}).reset_index()
early_diabe.columns=['Acct_No', 'min']
num(early_diabe)
early_diabe.rename(columns={"Acct_No": "TMA_Acct"}, inplace = 'True')
early_diabe.rename(columns={"min": "Early_Diabete"}, inplace = 'True')
early_diabe.to_csv('early_diabe.csv')
early_diabe.head()

2233
2233

   TMA_Acct Early_Diabete
0        16    2000-12-26
1        68    1998-04-27
2        81    2000-04-26
3        86    2010-10-22
4        97    2006-03-15

### Hypertension

In [18]:
early_hyper = pd.read_csv('early_hyper.csv')
early_hyper = early_hyper[['TMA_Acct', 'Early_Hypertension']]
num(early_hyper)

6502
6502

In [15]:
o1 = diag[diag.Code.str.match('^401')]
#o2 = diag[diag.Code.str.match('^401')]
#o3 = diag[diag.Code.str.match('^402')]
o4 = diag[diag.Code.str.match('^403')]
#o5 = diag[diag.Code.str.match('^404')]
o6 = diag[diag.Code.str.match('^405')]
o7 = diag[diag.Code.str.match('^I10')]
#o8 = diag[diag.Code.str.match('^I11')]
o9 = diag[diag.Code.str.match('^I12')]
o10 = diag[diag.Code.str.match('^I13')]
o11 = diag[diag.Code.str.match('^I15')]
o12 = diag[diag.Code.str.match('^I16')]
hyper = pd.concat([o1, o4, o6, o7, o9, o10, o11, o12], axis = 0)
hyper['Date'] = pd.to_datetime(hyper['Date'])
num(hyper)
hyper.head(2)

42424
6502

       Unnamed: 0  Acct_No       Date   Code          Description  Unnamed: 4
33197       33197       12 2001-04-19  401.1  hypertension benign         NaN
33209       33209       16 2001-02-21  401.1  hypertension benign         NaN

In [6]:
diag[diag.Description.str.match('.*hypertens')]['Code'].unique()

array(['I10', 'I12.9', 'I12.0', 'I13.2', 'I27.2', 'I15.8', 'I15.0',
       'I15.9', 'R03.0', 'I13.11', 'I16.0', 'I13.0', '403.91', '796.2',
       '401.1', '403.11', '401.9', '405.11', '403.9', '401', '405.91',
       '405.99', '403', '405.19', '403.1', 'I13.10', '583.81', '416',
       '405', 'I15.2', '405.09'], dtype=object)

In [16]:
early_hyper = hyper.groupby('Acct_No').agg({'Date': [np.min]}).reset_index()
early_hyper.columns=['TMA_Acct', 'min']
early_hyper.rename(columns={"min": "Early_Hypertension"}, inplace = 'True')
early_hyper.head()

   TMA_Acct Early_Hypertension
0         9         2001-05-29
1        12         2001-04-19
2        16         2000-09-20
3        37         2009-01-04
4        39         2000-04-28

In [17]:
early_hyper.to_csv('early_hyper.csv')

### Master + Hypertension + Diabetes

In [20]:
master = pd.read_csv('master.csv')
num(master)
base = master
base = base[['TMA_Acct', 'Account_Date', 'Sex', 'DOB', 'Race', 'Patient_Status_Date', 'Patient_Status']].drop_duplicates()
num(base)

16410
14816
16407
14816

In [21]:
base['DOB'] = base['DOB'].str[-4:]
base = base.replace('Black / African American', 'Black/African American')
base = base.replace('Declined to Specify / Unknown', 'Declined to Specify/Unknown')
base = base.replace('Other Race', 'Other')
base = base.drop_duplicates()
num(base)
base.head(2)

16383
14816

,TMA_Acct,Account_Date,Sex,DOB,Race,Patient_Status_Date,Patient_Status
0,9,06-01-2009,Male,1921,White,6-30-2010,Deceased
1,10,06-01-2009,Female,1926,NaN,NaN,Active

In [22]:
base_main = base[["TMA_Acct", "DOB", "Sex"]]
base_main = base_main.drop_duplicates()
num(base_main)
base_race = base[["TMA_Acct", "Race"]]
base_race = base_race.drop_duplicates()
base_race = base_race.dropna(subset = ['Race'])
num(base_race)

14820
14816
8171
8167

In [23]:
check_main = pd.DataFrame(base_main.groupby('TMA_Acct').size() > 1).reset_index()
check_main = list(set(check_main[check_main[0] == True]['TMA_Acct']))
check_race = pd.DataFrame(base_race.groupby('TMA_Acct').size() > 1).reset_index()
check_race = list(set(check_race[check_race[0] == True]['TMA_Acct']))

In [25]:
for i in check_main:
    print(show(base_main, i))

       TMA_Acct   DOB     Sex
10205     32967  2011  Female
14265     32967  1931  Female
       TMA_Acct   DOB     Sex
10779     34714  1954  Female
14350     34714  1954    Male
       TMA_Acct   DOB     Sex
13465     44639  1959  Female
14980     44639  1962  Female
       TMA_Acct   DOB   Sex
7767      25831  1900  Male
14014     25831  1959  Male

In [26]:
for i in check_race:
    print(show(base_race, i))

       TMA_Acct                    Race
5921      17506                   White
13880     17506  Black/African American
       TMA_Acct                         Race
11361     36531                        Asian
14431     36531  Declined to Specify/Unknown
       TMA_Acct                    Race
13593     45900                   White
15095     45900  Black/African American
       TMA_Acct                    Race
13059     42869                   Other
14838     42869  Black/African American

In [27]:
base_race.drop(base_race.loc[(base_race.TMA_Acct == 17506) & (base_race.Race == 'White')].index, inplace=True)
base_race.drop(base_race.loc[(base_race.TMA_Acct == 36531) & (base_race.Race == 'Declined to Specify/Unknown')].index, inplace=True)
base_race.drop(base_race.loc[(base_race.TMA_Acct == 42869) & (base_race.Race == 'Other')].index, inplace=True)
base_race.drop(base_race.loc[(base_race.TMA_Acct == 45900) & (base_race.Race == 'White')].index, inplace=True)

In [28]:
base_main.drop(base_main.loc[(base_main.TMA_Acct == 25831) & (base_main.DOB == '1900')].index, inplace=True)
base_main.drop(base_main.loc[(base_main.TMA_Acct == 32967) & (base_main.DOB == '2011')].index, inplace=True)
base_main.drop(base_main.loc[(base_main.TMA_Acct == 44639) & (base_main.DOB == '1962')].index, inplace=True)
base_main.drop(base_main.loc[(base_main.TMA_Acct == 34714)].index, inplace=True)

In [30]:
base = pd.merge(base_main, base_race, how = 'left', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
num(base)

14815
14815

In [39]:
base_hyper = pd.merge(base, early_hyper, how = 'left', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
base_hyper.rename(columns={"min": "hyper_date"}, inplace = 'True')
m_h_d = pd.merge(base_hyper, early_diabe, how = 'left', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
m_h_d.rename(columns={"min": "diabe_date"}, inplace = 'True')
m_h_d.head()

   TMA_Acct   DOB     Sex   Race Early_Hypertension Early_Diabete
0         9  1921    Male  White         2001-05-29           NaN
1        10  1926  Female    NaN                NaN           NaN
2        12  1922  Female  White         2001-04-19           NaN
3        16  1926  Female    NaN         2000-09-20    2000-12-26
4        17  1918  Female    NaN                NaN           NaN

In [38]:
id_in_hyper_not_in_base = list(set([i for i in list(early_hyper['TMA_Acct']) if i not in list(base['TMA_Acct'])]))
len(id_in_hyper_not_in_base)

11

In [40]:
id_in_diabe_not_in_base = list(set([i for i in list(early_diabe['TMA_Acct']) if i not in list(base['TMA_Acct'])]))
len(id_in_diabe_not_in_base)

2

In [41]:
num(m_h_d)

14815
14815

### + earliest lab date

In [42]:
len(set(list(new_lab['TMA_Acct']) + list(old_lab['TMA_Acct'])))

14816

In [43]:
new_lab_date = new_lab[['TMA_Acct', 'date']]
old_lab_date = old_lab[['TMA_Acct', 'date']]

In [44]:
lab_date = pd.concat([new_lab_date, old_lab_date], axis = 0)

In [45]:
num(lab_date)

3910049
14816

In [46]:
early_lab = pd.DataFrame(lab_date.groupby(['TMA_Acct']).agg({'date': [np.min]})).reset_index()
early_lab.columns=['TMA_Acct', 'earliest_date_in_all_lab']
num(early_lab)
early_lab.head(2)

14816
14816

   TMA_Acct earliest_date_in_all_lab
0         6               2017-02-20
1         9               2000-09-22

In [47]:
m_h_d_l = pd.merge(m_h_d, early_lab, how = 'left', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
m_h_d_l.head(2)
num(m_h_d_l)

14815
14815

### + BMI

In [38]:
bmi = pd.read_csv('BMI.csv')
print(len(bmi))
print(len(bmi['Acct#'].unique()))
print(min(bmi['Date']))
bmi = bmi[bmi['Date'] > '2009/09/31']
bmi.rename(columns={"Acct#": "TMA_Acct"}, inplace = 'True')
print(len(bmi))
print(len(bmi['TMA_Acct'].unique()))
bmi = bmi[bmi['TMA_Acct'].isin(tma)]
print(len(bmi))
print(len(bmi['TMA_Acct'].unique()))

43700
10484
2009/10/1
43700
10484
13528
3188

In [39]:
early_bmi = bmi.groupby('TMA_Acct').agg({'Date': [np.min]}).reset_index()
early_bmi.columns=['TMA_Acct', 'min']
bmi_min = pd.merge(bmi, early_bmi, left_on = ['TMA_Acct', 'Date'], right_on = ['TMA_Acct', 'min'])
bmi_min = bmi_min.drop_duplicates()

In [40]:
bmi_min = bmi_min[['TMA_Acct', 'Date', 'BMI']]
bmi_min.rename(columns={"Date": "Date_bmi"}, inplace = 'True')

In [41]:
print(len(bmi_min))
print(len(bmi_min['TMA_Acct'].unique()))

3213
3188

In [42]:
check_bmi = pd.DataFrame(bmi_min.groupby('TMA_Acct').size() > 1).reset_index()
check_bmi = list(set(check_bmi[check_bmi[0] == True]['TMA_Acct']))
bmi_error = bmi_min[bmi_min['TMA_Acct'].isin(check_bmi)]
bmi_error.to_csv('bmi_error.csv')

In [43]:
bmi_min = bmi_min[~bmi_min['TMA_Acct'].isin(check_bmi)]

In [44]:
m_h_d_l_b = pd.merge(m_h_d_l, bmi_min, how = 'left', left_on = 'TMA_Acct', right_on = 'TMA_Acct') 
print(len(m_h_d_l_b))
print(len(m_h_d_l_b['TMA_Acct'].unique()))
m_h_d_l_b.head(2)
#move status to the end

14815
14815

,TMA_Acct,DOB,Sex,Race,hyper_date,diabe_date,earliest_date_in_all_lab,Date_bmi,BMI
0,9,1921,Male,White,2001-05-29,NaN,2000-09-22,NaN,NaN
1,10,1926,Female,NaN,NaN,NaN,NaT,NaN,NaN

### + Age

In [45]:
m_h_d_l_b['Age_in_2010'] = 2010 - m_h_d_l_b['DOB'].astype(int)
m_h_d_l_b.head(2)

,TMA_Acct,DOB,Sex,Race,hyper_date,diabe_date,earliest_date_in_all_lab,Date_bmi,BMI,Age_in_2010
0,9,1921,Male,White,2001-05-29,NaN,2000-09-22,NaN,NaN,89
1,10,1926,Female,NaN,NaN,NaN,NaT,NaN,NaN,84

### + Start Stage

In [46]:
All_egfr = pd.read_csv('All_egfr.csv')[['TMA_Acct', 'date', 'egfr']]
print(min(All_egfr['date']))
print(len(All_egfr))
print(len(All_egfr['TMA_Acct'].unique()))
print(len(All_egfr))
print(len(All_egfr['TMA_Acct'].unique()))
All_egfr = All_egfr[All_egfr['date'] > '2009-09-30']
print(len(All_egfr))
print(len(All_egfr['TMA_Acct'].unique()))
All_egfr.head(2)

1990-08-06
95686
8186
95686
8186
65390
6143

    TMA_Acct        date       egfr
45        37  2012-05-29  17.868074
46        37  2012-07-26  15.204267

In [47]:
early_egfr = pd.DataFrame(All_egfr.groupby(['TMA_Acct']).agg({'date': [np.min]})).reset_index()
early_egfr.columns=['TMA_Acct', 'min']
print(len(early_egfr))
early_egfr.head(2)

6143

   TMA_Acct         min
0        37  2010-01-13
1        86  2010-10-09

In [48]:
first_enter = pd.merge(All_egfr, early_egfr, how = 'inner', left_on = ['TMA_Acct', 'date'], right_on = ['TMA_Acct', 'min'])
first_enter = first_enter.drop_duplicates()
print(len(first_enter))
print(len(first_enter['TMA_Acct'].unique()))
check = pd.DataFrame(first_enter.groupby('TMA_Acct').size() > 1).reset_index()
check = list(set(check[check[0] == True]['TMA_Acct']))
print(len(check))
first_enter.head(2)

6172
6143
29

   TMA_Acct        date       egfr         min
0        37  2010-01-13  20.085950  2010-01-13
1        86  2010-10-09  20.121101  2010-10-09

In [49]:
first_enter_date = first_enter[['TMA_Acct', 'date']]
first_enter_date = first_enter_date.drop_duplicates()
len(first_enter_date)

6143

In [50]:
avg_mean = pd.DataFrame(first_enter.groupby(['TMA_Acct']).agg({'egfr': [np.min]})).reset_index()
avg_mean.columns=['TMA_Acct', 'avg_egfr']
print(len(avg_mean))
avg_mean.head(2)

6143

   TMA_Acct   avg_egfr
0        37  20.085950
1        86  20.121101

In [51]:
avg_mean_egfr = pd.merge(avg_mean, first_enter_date, how = 'left', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
avg_mean_egfr.head(2)

   TMA_Acct   avg_egfr        date
0        37  20.085950  2010-01-13
1        86  20.121101  2010-10-09

In [52]:
def mapping(n):
    if n >= 90.0: stage = '1'
    elif n >= 60.0: stage = '2'
    elif n >= 45.0: stage = '3a'
    elif n >= 30.0: stage = '3b'
    elif n >= 15.0: stage = '4'
    else: stage = '5'
    return(stage)
avg_mean_egfr['stage'] = avg_mean_egfr['avg_egfr'].apply(lambda x: mapping(x))
print(len(avg_mean_egfr))
avg_mean_egfr = avg_mean_egfr.drop_duplicates()
print(len(avg_mean_egfr))

6143
6143

In [53]:
avg_mean_egfr.rename(columns={"date": "earliest_egfr_date"}, inplace = 'True')

In [54]:
m_h_d_l_b_e = pd.merge(m_h_d_l_b, avg_mean_egfr, how = 'left', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
print(len(m_h_d_l_b_e))
print(len(m_h_d_l_b_e['TMA_Acct'].unique()))
m_h_d_l_b_e.head(2)

14815
14815

,TMA_Acct,DOB,Sex,Race,hyper_date,diabe_date,earliest_date_in_all_lab,Date_bmi,BMI,Age_in_2010,avg_egfr,earliest_egfr_date,stage
0,9,1921,Male,White,2001-05-29,NaN,2000-09-22,NaN,NaN,89,NaN,NaN,NaN
1,10,1926,Female,NaN,NaN,NaN,NaT,NaN,NaN,84,NaN,NaN,NaN

### + Status

In [55]:
status = master[['TMA_Acct', 'Patient_Status_Date','Patient_Status']]
status = status.drop_duplicates()
print(len(status))
status.dropna(subset = ['Patient_Status'], inplace = True)
print(len(status))
print(len(status['TMA_Acct'].unique()))

15296
15089
14773

In [56]:
check_status = pd.DataFrame(status.groupby('TMA_Acct').size() > 1).reset_index()
check_status = list(set(check_status[check_status[0] == True]['TMA_Acct']))
status_main = status[~status['TMA_Acct'].isin(check_status)]
print(len(status_main))
status_dup = status[status['TMA_Acct'].isin(check_status)]

14457

In [57]:
status_dup = status_dup[status_dup['Patient_Status'] != 'Active']
print(len(status_dup))
print(len(status_dup['TMA_Acct'].unique()))

313
313

In [58]:
only = status[(status.TMA_Acct == 14295) & (status.Patient_Status_Date == '01-01-1900')]
only

      TMA_Acct Patient_Status_Date Patient_Status
4847     14295          01-01-1900         Active

In [59]:
status = pd.concat([status_dup, status_main])
status = pd.concat([status, only])

In [60]:
len(status)

14771

In [61]:
m_h_d_l_b_e_s = pd.merge(m_h_d_l_b_e, status, how = 'left', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
print(len(m_h_d_l_b_e_s))
print(len(m_h_d_l_b_e_s['TMA_Acct'].unique()))
m_h_d_l_b_e_s.head(2)

14815
14815

,TMA_Acct,DOB,Sex,Race,hyper_date,diabe_date,earliest_date_in_all_lab,Date_bmi,BMI,Age_in_2010,avg_egfr,earliest_egfr_date,stage,Patient_Status_Date,Patient_Status
0,9,1921,Male,White,2001-05-29,NaN,2000-09-22,NaN,NaN,89,NaN,NaN,NaN,6-30-2010,Deceased
1,10,1926,Female,NaN,NaN,NaN,NaT,NaN,NaN,84,NaN,NaN,NaN,NaN,Active

In [62]:
m_h_d_l_b_e_s.to_csv('baseline.csv')

In [63]:
baseline = pd.read_csv('baseline.csv')

In [64]:
len(baseline)

14815

In [65]:
print(len(baseline['TMA_Acct'].unique()))

14815